igfisdhghdfgsklfdslgk
dfg;ldkfgsldfnsg;ns
f'sgn'slgsdf;\'n


//Задача 19: Напишите программу,которая принимает на вход
// пятизначное число и проверяет,является ли оно палиндромом.
// 13431

int number = 13431;
int result = 0;
while (number > 0)
{
     int digit = number % 10;
     result = result * 10 + digit;
     number /= 10;
    Console.WriteLine(result);

}